
#Область ПрограммныйИнтерфейс

Функция ПолучитьАктивныеСеансыТекущегоПользователя() Экспорт
	
	АктивныеСеансыПользователя = Новый Массив;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	РазрешитьЗапускНесколькихСеансов = УправлениеСвойствами.ЗначениеСвойства(ТекущийПользователь, "ОНС_РазрешитьЗапускНесколькихСеансов");
	
	Если РазрешитьЗапускНесколькихСеансов = Истина Тогда
		Возврат АктивныеСеансыПользователя;
	КонецЕсли;
	
	ИдентификаторТекущегоПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ИдентификаторПользователяИБ");
	
	УстановитьПривилегированныйРежим(Истина);    
	
	СеансыИнформационнойБазы = ПолучитьСеансыИнформационнойБазы(); 	
	НомерСеансаИнформационнойБазы = НомерСеансаИнформационнойБазы();
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Для Каждого СеансИБ Из СеансыИнформационнойБазы Цикл
		
		Если СеансИБ.НомерСеанса = НомерСеансаИнформационнойБазы Тогда
			Продолжить;
		КонецЕсли;
		
		Если СеансИБ.Пользователь.УникальныйИдентификатор = ИдентификаторТекущегоПользователя 
			И СеансИБ.ИмяПриложения = "1CV8C" Или СеансИБ.ИмяПриложения = "1CV8" Тогда
			
			АктивныеСеансыПользователя.Добавить(СеансИБ.НомерСеанса);			
			
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат АктивныеСеансыПользователя;

КонецФункции

#КонецОбласти